package ch2.r9;

/**
 * 레시피 2.9 : 후처리기 만들어 POJO 검증/수정하기
 *  - 모든 빈 인스턴스, 또는 특정 타입의 인스턴스 생성할 때 해당 빈 프로퍼티를 어떤 기준에 따라 검증/수정하기
 *
 *
 * ->
 * 빈 후처리기(bean pist-processor) 이용하면 초기화 콜백 메서드(@Bean의 initMethod 속성에 지정한 메서드나 @PostConstruct 붙인 메서드)
 * 전후에 원하는 로직을 빈에 적용할 수 있다.
 *
 * 빈 후처리기의 가장 주요한 특징은 IoC 컨테이너 내부의 모든 빈 인스턴스를 대상으로 한다는 점이다.
 *
 * 보통 빈 후처리기는 빈 프로퍼티가 올바른지 체크하거나 어떤 기준에 따라 빈 프로퍼티를 변경 또는 전체 빈 인스턴스를 상대로 어ㄸ
 * 작업을 수행하는 용도로 쓰인다.
 *
 * @Required는 스프링에 내장된 후처리기 RequiredAnnotationBeanPostProcessor가 지원하는 애너테이션이다.
 *
 * RequiredAnnotationBeanPostProcessor 후처리기는 @Required를 붙인 모든 빈 프로퍼티가 설정되었는지 확인한다.
 *
 *
 * 쓰임]
 * 빈이 잘 생성되었나 하나하나 검사해야 하는 경우가 있다. 앱 디버깅, 빈마다 프로퍼티 값 맞는지 등등...
 *
 * 빈 후처리기를 사용하면 기존 POJO 코드를 전혀 건드릴 필요가 없으므로 아주 이상적이다.
 *
 *
 * */
public class Main {
}
